Revit 2027 API
ParameterTypeId.PartMakerSplitterProfile Property
 "Division Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PartMakerSplitterProfile { get; }
Public Shared ReadOnly Property PartMakerSplitterProfile As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PartMakerSplitterProfile {
	ForgeTypeId^ get ();
}
static member PartMakerSplitterProfile : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace